app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-03-08 21:58:22.636639"], ["id", 1]]